Repository: shahinabbasidev/FastApi_Expense_Management
Catalog: core/locales/*/LC_MESSAGES/messages.po
Languages: de, fa, fr

source: User has been created successfully.
de: Der Benutzer wurde erfolgreich erstellt.
fa: کاربر با موفقیت ایجاد شد.
fr: L'utilisateur a été créé avec succès.

source: You have logged in successfully.
de: Sie haben sich erfolgreich angemeldet.
fa: شما با موفقیت وارد حساب کاربری خود شدید.
fr: Vous vous êtes connecté avec succès.

source: You have been logged out successfully.
de: Sie haben sich erfolgreich abgemeldet.
fa: شما با موفقیت از حساب کاربری خود خارج شدید.
fr: Vous vous êtes déconnecté avec succès.

source: User already exists.
de: Ein Benutzer mit diesen Daten existiert bereits.
fa: کاربری با این اطلاعات از قبل وجود دارد.
fr: Un utilisateur avec ces informations existe déjà.

source: Password is required.
de: Ein Passwort ist erforderlich.
fa: وارد کردن رمز عبور الزامی است.
fr: Le mot de passe est requis.

source: No user found with the provided details.
de: Kein Benutzer mit den angegebenen Daten gefunden.
fa: کاربری با اطلاعات ارائه‌شده یافت نشد.
fr: Aucun utilisateur trouvé avec les informations fournies.

source: Invalid username or password.
de: Ungültiger Benutzername oder Passwort.
fa: نام کاربری یا رمز عبور نامعتبر است.
fr: Nom d'utilisateur ou mot de passe invalide.

source: Your session has expired. Please log in again
de: Ihre Sitzung ist abgelaufen. Bitte melden Sie sich erneut an.
fa: نشست شما منقضی شده است. لطفاً دوباره وارد شوید.
fr: Votre session a expiré. Veuillez vous reconnecter.

source: Invalid authentication token.
de: Ungültiges Authentifizierungs-Token.
fa: توکن احراز هویت نامعتبر است.
fr: Jeton d'authentification invalide.

source: The token is invalid or has expired.
de: Das Token ist ungültig oder abgelaufen.
fa: توکن نامعتبر است یا منقضی شده است.
fr: Le jeton est invalide ou a expiré.

source: The password reset link is invalid or has expired.
de: Der Link zum Zurücksetzen des Passworts ist ungültig oder abgelaufen.
fa: لینک بازنشانی رمز عبور نامعتبر است یا منقضی شده است.
fr: Le lien de réinitialisation du mot de passe est invalide ou a expiré.

source: Refresh token not found.
de: Refresh-Token nicht gefunden.
fa: توکن نوسازی یافت نشد.
fr: Jeton de rafraîchissement introuvable.

source: Your session has been refreshed successfully.
de: Ihre Sitzung wurde erfolgreich erneuert.
fa: نشست شما با موفقیت نوسازی شد.
fr: Votre session a été actualisée avec succès.

source: Authentication failed, invalid signature.
de: Authentifizierung fehlgeschlagen, ungültige Signatur.
fa: احراز هویت ناموفق بود، امضای نامعتبر است.
fr: Échec de l'authentification, signature invalide.

source: Authentication failed, payload invalid.
de: Authentifizierung fehlgeschlagen, ungültige Nutzlast.
fa: احراز هویت ناموفق بود، محتوای توکن نامعتبر است.
fr: Échec de l'authentification, charge utile invalide.

source: NOT authenticated.
de: Nicht authentifiziert.
fa: احراز هویت انجام نشده است.
fr: Non authentifié.

source: Invalid token type. Expected a refresh token.
de: Ungültiger Tokentyp. Ein Refresh-Token wurde erwartet.
fa: نوع توکن نامعتبر است. توکن تازه‌سازی مورد انتظار بود.
fr: Type de jeton invalide. Un jeton de rafraîchissement était attendu.

source: Invalid token type. Expected an access token.
de: Ungültiger Tokentyp. Ein Access-Token wurde erwartet.
fa: نوع توکن نامعتبر است. توکن دسترسی مورد انتظار بود.
fr: Type de jeton invalide. Un jeton d'accès était attendu.

source: Your profile has been updated successfully.
de: Ihr Profil wurde erfolgreich aktualisiert.
fa: پروفایل شما با موفقیت به‌روزرسانی شد.
fr: Votre profil a été mis à jour avec succès.

source: Expense not found.
de: Ausgabe nicht gefunden.
fa: هزینه پیدا نشد.
fr: Dépense non trouvée.

source: Expense has been removed successfully.
de: Ausgabe wurde erfolgreich gelöscht.
fa: هزینه با موفقیت حذف شد.
fr: La dépense a été supprimée avec succès.

source: User not found.
fa: کاربر پیدا نشد.

source: User has been removed successfully.
fa: کاربر با موفقیت حذف شد.
